In [24]:
my_dict = {
    'name':["a", "b", "c", "d", "f", "g"],
    'age':[20, 27, 35, 55, 18, 21],
    "designition":["VP", "CEO", "CFO", "VP", "CEO", "MD"]
}

In [59]:
import pandas as pd
import numpy as np

df = pd.DataFrame(my_dict, index = np.array([10*x for x in range(1, 7)]))
df

    age designition name
10   20          VP    a
20   27         CEO    b
30   35         CFO    c
40   55          VP    d
50   18         CEO    f
60   21          MD    g

In [60]:
df.dtypes

age             int64
designition    object
name           object
dtype: object

In [61]:
df.head()[2:5]

    age designition name
30   35         CFO    c
40   55          VP    d
50   18         CEO    f

In [62]:
df.index

Int64Index([10, 20, 30, 40, 50, 60], dtype='int64')

In [70]:
df['designition'].unique()

array(['VP', 'CEO', 'CFO', 'MD'], dtype=object)

In [73]:
print(df['age'].count())
print(df['age'].sum())

6
176

In [74]:
df.set_index("name")

      age designition
name
a      20          VP
b      27         CEO
c      35         CFO
d      55          VP
f      18         CEO
g      21          MD

In [76]:
df.reindex()

    age designition name
10   20          VP    a
20   27         CEO    b
30   35         CFO    c
40   55          VP    d
50   18         CEO    f
60   21          MD    g

In [92]:
myl=[[x for x in range(4 * y,4*y + 4)] for y in range(0, 4)]

In [93]:
myl

[[0, 1, 2, 3], [4, 5, 6, 7], [8, 9, 10, 11], [12, 13, 14, 15]]

In [107]:
df = pd.DataFrame(myl)

In [108]:
df[0] = df[0].map(lambda x: x * 10)
df

     0   1   2   3
0    0   1   2   3
1   40   5   6   7
2   80   9  10  11
3  120  13  14  15

In [109]:
ser1 = df[0]

In [110]:
ser1

0      0
1     40
2     80
3    120
Name: 0, dtype: int64

In [111]:
for val in ser1:
    print(val)

0
40
80
120

In [112]:
for (row_index) in ser1.keys():
    print(row_index)

0
1
2
3